# TP2 - DB Normalization and Querying (By Daniel Jorge Deutsch)

The objectives of this TP are:
1. Apply normalization 1NF -> 2NF -> 3NF
2. Perform SQL queries on the normalized database

In this TP, we will use a database **`wine.db`** (available in the course's website) containing wine information related to 'production' and 'sales'. 

> Production <---> Wine <---> Sales


---

### Working with db files in Jupyter
- Python provides an interface for SQLite through the *sqlite3* module
- The **`%%sql`** magic builds upon it (and other tools) to enable the usage of SQL commands within a Jupyter Notebook as in common SQL clients.
- Before proceeding, make sure that **`wine.db`** is in the same path as this notebook.
  - If **`wine.db`** is not in the same path, an empty **`wine.db`** file will be created, resulting in errors in later steps of the TP.
- The SQLite module in Python commits transactions automatically, this means that any change in the DB is immediately written to the file, e.g. creating/deleting tables.
  -  For this reason, it is recommended to have a backup of **`wine.db`** as it is provided in the course's website.

---

**`wine.db`** contains the following unnormalized tables:

<center>**Master1**</center>

|*Attribute*|         *Description*          |
| -------   |--------------------------------|
| NV        | Wine number                    |
| CRU       | Vineyard or group of vineyards |
| DEGRE     | Alcohol content                |
| MILL      | Vintage year                   |
| QTE       | Number of bottles harvested    |
| NP        | Producer number                |
| NOM       | Producer's last name           |
| PRENOM    | Producer's first name          |
| REGION    | Production region              |

From wikipedia:

__Cru__: Often used to indicate a specifically named and legally defined vineyard or ensemble of vineyards and the vines "which grow on [such] a reputed terroir; by extension of good quality." The term is also used to refer to the wine produced from such vines.


<center>**Master2**</center>

|*Attribute*|                         *Description*                  |
| -------   |--------------------------------------------------------|
| NV        | Wine number                                            |
| CRU       | Vineyard or group of vineyards                         |
| DEGRE     | Alcohol content                                        |
| MILL      | Vintage year                                           |
| DATES     | Buying date                                            |
| LIEU      | Place where the wine was sold                          |
| QTE       | Number of bottles bought                               |
| NB        | Client (buveur) number                                 |
| NOM       | Client's last name                                     |
| PRENOM    | Client's first name                                    |
| TYPE      | Type of client by volume of purchases                  |
| REGION    | Administrative Region (different to production region) |

In [1]:
import sqlite3    # Python interface for SQLite databases

In [2]:
def printSchema(connection):
    # Function to print the DB schema
    # Source: http://stackoverflow.com/a/35092773/4765776
    for (tableName,) in connection.execute(
        """
        select NAME from SQLITE_MASTER where TYPE='table' order by NAME;
        """
    ):
        print("{}:".format(tableName))
        for (
            columnID, columnName, columnType,
            columnNotNull, columnDefault, columnPK,
        ) in connection.execute("pragma table_info('{}');".format(tableName)):
            print("  {id}: {name}({type}){null}{default}{pk}".format(
                id=columnID,
                name=columnName,
                type=columnType,
                null=" not null" if columnNotNull else "",
                default=" [{}]".format(columnDefault) if columnDefault else "",
                pk=" *{}".format(columnPK) if columnPK else "",
            ))

In [3]:
conn = sqlite3.connect('wine.db')
c = conn.cursor()
print("Database schema:")
printSchema(conn)           # An usefull way to viualize the content of the database

Database schema:
LOCATION:
  0: LIEU(TEXT)
  1: REGION(TEXT)
MASTER1:
  0: NV(NUM)
  1: CRU(TEXT)
  2: DEGRE(NUM)
  3: MILL(NUM)
  4: QTE(NUM)
  5: NP(NUM)
  6: NOM(TEXT)
  7: PRENOM(TEXT)
  8: REGION(TEXT)
MASTER2:
  0: NV(NUM)
  1: CRU(TEXT)
  2: DEGRE(NUM)
  3: MILL(NUM)
  4: DATES(DATE)
  5: LIEU(TEXT)
  6: QTE(NUM)
  7: NB(NUM)
  8: NOM(TEXT)
  9: PRENOM(TEXT)
  10: TYPE(TEXT)
  11: REGION(TEXT)
client:
  0: NB(NUM)
  1: NOM(TEXT)
  2: PRENOM(TEXT)
  3: TYPE(TEXT)
producer:
  0: NP(NUM)
  1: NOM(TEXT)
  2: PRENOM(TEXT)
  3: REGION(TEXT)
production:
  0: NP(NUM)
  1: NV(NUM)
  2: QTE(NUM)
purchase:
  0: NB(NUM)
  1: NV(NUM)
  2: DATES(NUM)
  3: LIEU(TEXT)
  4: QTE(NUM)
wine:
  0: NV(NUM)
  1: CRU(TEXT)
  2: DEGRE(NUM)
  3: MILL(NUM)

From this point we will use __%%sql__ magic

In [4]:
%load_ext sql
%sql sqlite:///wine.db

# PART I: Database normalization

The first task on this TP is the normalization of the wine data. In its current state both tables **Master1** and **Master2** are in the First Normal Form (1NF).

By inspecting the content of these tables we can see that multiple tuples have NULL values.

In [5]:
%%sql SELECT *
FROM Master1
LIMIT 10;

 * sqlite:///wine.db
Done.

[(None, None, None, None, None, 3, 'Six', 'Paul', 'Alsace'),
 (None, None, None, None, None, 6, 'Marmagne', 'Bernard', 'Bourgogne'),
 (None, None, None, None, None, 8, "Lioger d'Harduy", 'Gabriel', 'Bourgogne'),
 (None, None, None, None, None, 16, 'Barbin', 'Bernard', 'Bourgogne'),
 (None, None, None, None, None, 17, 'Faiveley', 'Guy', 'Bourgogne'),
 (None, None, None, None, None, 18, 'Tramier', 'Jean', 'Bourgogne'),
 (None, None, None, None, None, 19, 'Dupaquier', 'Roger', 'Bourgogne'),
 (None, None, None, None, None, 20, 'Lamy', 'Jean', 'Bourgogne'),
 (None, None, None, None, None, 21, 'Cornu', 'Edmond', 'Bourgogne'),
 (None, None, None, None, None, 26, 'Violot', 'Gilbert', 'Bourgogne')]

* Notice that Jupyter *displays* 'None' instead of 'NULL'. 
  - This is only to comply with python notation.
* To account for NULL values, your SQL queries must test explicitly for 'NULL'.

Another problem in **Master1** and **Master2** is data redundancy, for example:

In [6]:
%%sql SELECT *
FROM Master1
WHERE NV = 45;

 * sqlite:///wine.db
Done.

[(45, 'Chiroubles', None, 1983, 90, 2, 'Boxler', 'Albert', 'Alsace'),
 (45, 'Chiroubles', None, 1983, 912, 67, 'Descombes', 'Jean Ernest', 'Beaujolais'),
 (45, 'Chiroubles', None, 1983, 98, 71, 'Chalandard', 'Danile', 'Jura'),
 (45, 'Chiroubles', None, 1983, 540, 78, 'Michlel', 'Pierre Emile', 'Jura'),
 (45, 'Chiroubles', None, 1983, 450, 86, 'Dumazet', 'Marc', 'Rhone')]

---

Additional resource for Normalization:

https://www.youtube.com/watch?v=UrYLYV7WSHM

---

#### Exercise 1.1

Convert table **Master1** to the Second Normal Form (2NF) or Third Normal Form (3NF) as applicable.
* Explain your answer
* List main functional dependencies (not all of them)
* Describe the schema of new tables and how they relate
  * You can write Tables as above or you can insert images in the notebook.
  
Remember that **`wine.db`** contains information related to wine 'production' and 'sells'.

> Production <---> Wine <---> Sales

A good start point is to look for the 'Wine' attributes.

**Hint:** Look for redundant information between the master tables.

**1NF:**

We notice that the table Master1, with key (NV, NP), is already in the First Normal Form since:

- The values in each cell are atomic (can't be splitted);
- The values in each column follow the same data type;
- Rows are uniquely identified;

<br>

**2NF:**

To adequate the information on table Master1 to the Second Normal Form, we should:

- Respect the 1NF;
- Every attribute (i.e. every non-key value) should be dependent on the key;

<br>

**3NF:**

Finally, to the Third Normal Form, we should have:

- All columns can be determined only by the key of the table;

<br>

**Functional Dependencies:**

Firstly, we notice that CRU, DEGRE and MILL are attributes that depend only on the wine itself, so they must be set on a separete table alongside with NV (the table key). Then, we realize that NOM, PRENOM and REGION are attributes related to the wine producer, therefore, they should also be moved to a different table with the key being NP. Finally, we see that QTE depends on both the wine and the producer, so it should be on a table with key (NV, NP).

- {NP} -> {NOM, PRENOM, REGION}: given the producer number of the wine, we should be able to identify the producer's attributes such as its first name, last name and the production region;
- {NV} -> {CRU, DEGRE, MILL}: given the wine number, we should be able to identify the vineyard that produced the wine grapes, the amount of alcohol in the wine and its vintage year;
- {NV, NP} -> {QTE}: given the wine and the producer numbers, we should be able to identify the number of bottles harvest; 

<br>

**Solution:**

Considering all that, to respect the 3NF, we could use the following schemas:

*Producer table:*

| *Attribute* | *Status*              | *Description*               |
|-------------|----------------------:|----------------------------:|
| NP          | Key                   | Producer number             |
| NOM         |                       | Producer's last name        |
| PRENOM      |                       | Producer's first name       |
| REGION      |                       | Production region           |

*Wine table:*

| *Attribute* | *Status*              | *Description*                        |
|-------------|----------------------:|-------------------------------------:|
| NV          | Key                   | Wine number                          |
| CRU         |                       | Vineyard or group of vineyards       |
| DEGRE       |                       | Alcohol content                      |
| MILL        |                       | Vintage year                         |

*Production table:*

| *Attribute* | *Status*              | *Description*                     |
|-------------|----------------------:|----------------------------------:|
| NV          | Key                   | Wine number                       |
| NP          | Key                   | Producer number                   |
| QTE         |                       | Number of bottles harvested       |

[Write your answer here]

#### Exercise 1.2

Convert table **Master2** to the Second Normal Form (2NF) or Third Normal Form (3NF) as applicable.
* Explain your answer
* List main functional dependencies (not all of them)
* Describe the schema of new tables and how they relate
  * You can write Tables as above or you can insert images in the notebook.

**Note:** For this part, consider that a wine can be bought in multiple locations and multiple times per day.

[Write your answer here]

**Functional Dependencies:**

Following the definitions of the 1NF, 2NF and 3NF defined in the previous exercise, we can see that the table Master2 (with key (NB, NV)) is already in the 1NF.

Firstly we notice that now, instead of information about the wine producer, we have information about the wine buyer. This, to respect the 3NF should be placed on a different table with key NB. Then, we notice that on the table Master2 we have the same information about wine that was present on the table Master1 (NV, CRU, DEGRE, MILL), so it should be on a separate table as stated in the previous exercise. Then, we notice that we have information about the client's purchase (the client, wine, QTE, DATE and LIEU). Finally, we can see that the REGION can be easily identified by the LIEU, so it should be on a separate table and the purchase table should use a foreignkey to identify the REGION.

- {NV} -> {CRU, DEGRE, MILL}: given the wine number, we should be able to identify the vineyard that produced the wine grapes, the amount of alcohol in the wine and its vintage year;
- {NB} -> {NOM, PRENOM, TYPE}: given the client number, we should be able to identify attributes related to the client such as its first and last name and its type;
- {NV, NB, DATE, LIEU} -> {QTE}: for one to know the amount of wine bought, it should have information about the client, the wine and the place and time the selling occured (a wine can be bought in multiple locations and multiple times per day);
- {LIEU} -> {REGION}: given the location where the wine was sold, one should be able to identify its region;
 
<br>

**Solution:**

Considering all that, to respect the 3NF, we could use the following schemas:

*Wine table:*

| *Attribute* | *Status*              | *Description*                        |
|-------------|----------------------:|-------------------------------------:|
| NV          | Key                   | Wine number                          |
| CRU         |                       | Vineyard or group of vineyards       |
| DEGRE       |                       | Alcohol content                      |
| MILL        |                       | Vintage year                         |

*Client table:*

| *Attribute* | *Status*              | *Description*                               |
|-------------|----------------------:|--------------------------------------------:|
| NB          | Key                   | Client (buveur) number                      |
| NOM         |                       | Client's last name                          |
| PRENOM      |                       | Client's first name                         |
| TYPE        |                       | Type of client by volume of purchases       |

*Purchase table:*

| *Attribute* | *Status*              | *Description*                       |
|-------------|----------------------:|------------------------------------:|
| NV          | Key                   | Wine number                         |
| NB          | Key                   | Client (buveur) number              |
| DATES       | Key                   | Buying date                         |
| LIEU        | Key                   | Place where the wine was sold       |
| QTE         |                       | Number of bottles bought            |

*Region table:*

| *Attribute* | *Status*              | *Description*                                                |
|-------------|----------------------:|-------------------------------------------------------------:|
| LIEU        | Key                   | Place where the wine was sold                                |
| REGION      | Key                   | Administrative Region (different to production region)       |

Once you have defined the 2NF or 3NF (as applicable) we need to split the data into new tables.

A table can be created from the result of a query.

In the following example we will create a new table "dummy" to store the different values of alcohol content.

In [7]:
%%sql DROP TABLE IF EXISTS dummy;

-- Create dummy table
CREATE TABLE dummy AS
SELECT DISTINCT DEGRE
FROM MASTER1;

 * sqlite:///wine.db
Done.
Done.

[]

In [8]:
print("\nContent of the database")
printSchema(conn)

Content of the database
LOCATION:
  0: LIEU(TEXT)
  1: REGION(TEXT)
MASTER1:
  0: NV(NUM)
  1: CRU(TEXT)
  2: DEGRE(NUM)
  3: MILL(NUM)
  4: QTE(NUM)
  5: NP(NUM)
  6: NOM(TEXT)
  7: PRENOM(TEXT)
  8: REGION(TEXT)
MASTER2:
  0: NV(NUM)
  1: CRU(TEXT)
  2: DEGRE(NUM)
  3: MILL(NUM)
  4: DATES(DATE)
  5: LIEU(TEXT)
  6: QTE(NUM)
  7: NB(NUM)
  8: NOM(TEXT)
  9: PRENOM(TEXT)
  10: TYPE(TEXT)
  11: REGION(TEXT)
client:
  0: NB(NUM)
  1: NOM(TEXT)
  2: PRENOM(TEXT)
  3: TYPE(TEXT)
dummy:
  0: DEGRE(NUM)
producer:
  0: NP(NUM)
  1: NOM(TEXT)
  2: PRENOM(TEXT)
  3: REGION(TEXT)
production:
  0: NP(NUM)
  1: NV(NUM)
  2: QTE(NUM)
purchase:
  0: NB(NUM)
  1: NV(NUM)
  2: DATES(NUM)
  3: LIEU(TEXT)
  4: QTE(NUM)
wine:
  0: NV(NUM)
  1: CRU(TEXT)
  2: DEGRE(NUM)
  3: MILL(NUM)

In [9]:
%%sql
SELECT *
FROM dummy;

 * sqlite:///wine.db
Done.

[(None,),
 (11.5,),
 (11.3,),
 (12.1,),
 (10.9,),
 (11.7,),
 (11.2,),
 (12.3,),
 (11.9,),
 (11.8,),
 (10.7,),
 (11.4,),
 (10.5,),
 (11,),
 (11.6,),
 (12,),
 (10,),
 (12.5,),
 (10.8,),
 (14,),
 (11.1,),
 (13,)]

Looking into "dummy", we notice that our query includes NULL. This is not allowed if we were to use DEGRE as key for a table.

To correct this, we need to change the query to explicitly test for NULL as follows:

In [10]:
%%sql DROP TABLE IF EXISTS dummy;

-- Create dummy table
CREATE TABLE dummy AS
SELECT DISTINCT DEGRE
FROM MASTER1
WHERE DEGRE IS NOT NULL;

SELECT *
FROM dummy;

 * sqlite:///wine.db
Done.
Done.
Done.

[(11.5,),
 (11.3,),
 (12.1,),
 (10.9,),
 (11.7,),
 (11.2,),
 (12.3,),
 (11.9,),
 (11.8,),
 (10.7,),
 (11.4,),
 (10.5,),
 (11,),
 (11.6,),
 (12,),
 (10,),
 (12.5,),
 (10.8,),
 (14,),
 (11.1,),
 (13,)]

Notice that we use `NULL` given that `None` is only used for display.

In [11]:
# Remove "dummy" table
%sql DROP TABLE IF EXISTS dummy;

 * sqlite:///wine.db
Done.

[]

#### Exercise 1.3

Create the new tables from Master1:

In [12]:
%%sql 

DROP TABLE IF EXISTS producer;

CREATE TABLE producer AS
SELECT DISTINCT 
    NP, NOM, PRENOM, REGION
FROM MASTER1
WHERE 
    NP IS NOT NULL;

 * sqlite:///wine.db
Done.
Done.

[]

In [13]:
%%sql

DROP TABLE IF EXISTS wine;

CREATE TABLE wine AS
SELECT DISTINCT 
    NV, CRU, DEGRE, MILL
FROM 
    MASTER1
WHERE 
    NV IS NOT NULL;

 * sqlite:///wine.db
Done.
Done.

[]

In [14]:
%%sql

DROP TABLE IF EXISTS production;

CREATE TABLE production AS
SELECT DISTINCT
    NP, NV, QTE
FROM 
    MASTER1
WHERE 
    NV IS NOT NULL 
    OR NP IS NOT NULL;

 * sqlite:///wine.db
Done.
Done.

[]

#### Exercise 1.4

Create the new tables from Master2:

In [15]:
%%sql 

DROP TABLE IF EXISTS client;

CREATE TABLE client AS
SELECT DISTINCT 
    NB, NOM, PRENOM, TYPE
FROM 
    MASTER2
WHERE 
    NB IS NOT NULL;

 * sqlite:///wine.db
Done.
Done.

[]

In [16]:
%%sql

DROP TABLE IF EXISTS purchase;

CREATE TABLE purchase AS
SELECT DISTINCT 
    NB, NV, DATES, LIEU, QTE 
FROM MASTER2
WHERE 
    NB IS NOT NULL
    AND NV IS NOT NULL
    AND DATES IS NOT NULL
    AND LIEU IS NOT NULL;

 * sqlite:///wine.db
Done.
Done.

[]

In [17]:
# It is not necessary to create the wine table from the Master2 table because it would have the same schema and content as the wine table created from the Master1 table.

In [18]:
%%sql 

DROP TABLE IF EXISTS LOCATION;

CREATE TABLE LOCATION AS
SELECT DISTINCT 
    LIEU, REGION
FROM MASTER2
WHERE 
    LIEU IS NOT NULL;

 * sqlite:///wine.db
Done.
Done.

[]

# PART II: SQL QUERIES

In the second part of this TP you will create SQL queries to retrieve information from the database.

**Important:**

- You MUST use the normalized tables created in previous steps.
  - The normalized tables will also be used in TP3.
- Do NOT use **Master1** and **Master2** in your queries.

#### Exercise 2.1

What are the different types of clients (buveurs) by volume of purchases?

In [19]:
%%sql

SELECT DISTINCT 
    TYPE
FROM client;

 * sqlite:///wine.db
Done.

[('petit',), ('moyen',), ('gros',)]

#### Exercise 2.2

What regions produce Pommard or Brouilly?

In [20]:
%%sql

SELECT DISTINCT
    CRU, REGION
FROM
    wine, producer, production
WHERE 
    (wine.CRU = 'Pommard' OR wine.CRU = 'Brouilly')
    AND producer.NP = production.NP
    AND production.NV = wine.NV;

 * sqlite:///wine.db
Done.

[('Pommard', 'Bourgogne'), ('Pommard', 'Rhone'), ('Brouilly', 'Bourgogne')]

#### Exercise 2.3

What regions produce Pommard and Brouilly?

In [21]:
%%sql

SELECT 
    REGION 
FROM 
    wine, producer, production
WHERE 
    wine.CRU = 'Pommard'
    AND producer.NP = production.NP
    AND production.NV = wine.NV
INTERSECT
SELECT 
    REGION 
FROM 
    wine, producer, production
WHERE 
    wine.CRU = 'Brouilly'
    AND producer.NP = production.NP
    AND production.NV = wine.NV;

 * sqlite:///wine.db
Done.

[('Bourgogne',)]

#### Exercise 2.4

Get the number of wines bught by CRU and Mill√©sime

In [22]:
%%sql

SELECT 
    CRU, MILL, SUM(QTE) AS N_WINES
FROM 
    wine, purchase
WHERE 
    wine.NV = purchase.NV
GROUP BY 
    CRU, MILL
ORDER BY 
    CRU;

 * sqlite:///wine.db
Done.

[('Arbois', 1980, 8),
 ('Auxey Duresses', 1914, 80),
 ('Beaujolais Primeur', 1983, 7),
 ('Beaujolais Villages', 1975, 10),
 ('Beaujolais Villages', 1976, 120),
 ('Beaujolais Villages', 1978, 130),
 ('Beaujolais Villages', 1979, 520),
 ('Chapelle Chambertin', 1973, 30),
 ('Chateau Corton Grancey', 1980, 4),
 ('Chenas', 1984, 1),
 ('Clairette de Die', 1976, 5),
 ('Cornas', 1980, 25),
 ('Cote de Brouilly', 1980, 23),
 ('Coteaux du Tricastin', 1974, 1),
 ('Coteaux du Tricastin', 1978, 12),
 ('Cotes de Beaune Villages', 1971, 14),
 ('Cotes de Beaune Villages', 1975, 96),
 ('Cotes de Nuits', 1978, 21),
 ('Cotes de Provence', 1980, 18),
 ('Etoile', 1980, 9),
 ('Fleurie', 1980, 7),
 ('Gentil', 1975, 36),
 ('Gigondas', 1978, 5),
 ('Grands Echezeaux', 1968, 31),
 ('Julienas', 1974, 2),
 ('Mercurey', 1980, 57),
 ('Mercurey', 1981, 36),
 ('Meursault', 1980, 2),
 ('Monthelie', 1968, 106),
 ('Pommard', 1972, 23),
 ('Pommard', 1976, 55),
 ('Pouilly Vinzelles', 1968, 10),
 ('Rasteau', 1980, 15),
 ('Richebourg', 1943, 72),
 ('Saint Amour', 1974, 80),
 ('Saint Amour', 1980, 14),
 ('Savigny les Beaunes', 1974, 44),
 ('Savigny les Beaunes', 1977, 7),
 ('Savigny les Beaunes', 1978, 11),
 ('Seyssel', 1974, 24),
 ('Seyssel', 1980, 21),
 ('Tavel', 1980, 33),
 ('Volnay', 1980, 5)]

#### Exercise 2.5

Retrieve the wine number (NV) of wines produced by more than three producers

In [23]:
%%sql

SELECT 
    NV, COUNT(NP) AS N_PRODUCERS
FROM 
    production
WHERE 
    NV IS NOT NULL
GROUP BY 
    NV
HAVING 
    COUNT(NP) > 3;

 * sqlite:///wine.db
Done.

[(45, 5), (78, 5), (89, 4), (98, 5)]

#### Exercise 2.6

Which producers have not produced any wine?

In [24]:
%%sql 

SELECT 
    producer.NP, producer.NOM, producer.PRENOM 
FROM 
    producer
LEFT JOIN production ON 
    producer.NP = production.NP
WHERE 
    production.NV IS NULL;

 * sqlite:///wine.db
Done.

[(3, 'Six', 'Paul'),
 (6, 'Marmagne', 'Bernard'),
 (8, "Lioger d'Harduy", 'Gabriel'),
 (16, 'Barbin', 'Bernard'),
 (17, 'Faiveley', 'Guy'),
 (18, 'Tramier', 'Jean'),
 (19, 'Dupaquier', 'Roger'),
 (20, 'Lamy', 'Jean'),
 (21, 'Cornu', 'Edmond'),
 (26, 'Violot', 'Gilbert'),
 (28, 'Monnier', 'Rene'),
 (29, 'de Suremain', 'Robert'),
 (31, 'Prudhon', 'Henri'),
 (32, 'Mestre', 'Philippe'),
 (33, 'Prieur', 'Guy'),
 (34, 'Monnier', 'Rene'),
 (37, 'Delagrange Bachelet', None),
 (39, 'de Suremin', 'Hugues'),
 (41, 'Juillot', 'Michel'),
 (44, 'Feyveley', None),
 (47, 'Thenard', None),
 (48, 'Flamand', None),
 (49, 'Guillot', 'Pierre'),
 (51, 'Simonet', 'Leon'),
 (53, 'Cooperative', None),
 (57, 'Desmules', 'Pierre'),
 (58, 'Joubert', 'Claude'),
 (61, 'Champier', 'Charles'),
 (62, 'Champagnon', 'Louis'),
 (66, 'Cooperative', None),
 (77, 'Tissot', 'Andre'),
 (83, 'Goy', None),
 (91, 'Chave', 'Gerard'),
 (92, 'De Boissieu', None),
 (94, 'Grippat', 'Jean Louis'),
 (96, 'Boisson', 'Jean Pierre'),
 (97, 'Quiot', 'Pierre'),
 (100, 'Bernard', 'Georges'),
 (101, 'Verdan', 'Antoine'),
 (102, 'Cooperative', None),
 (103, 'Coulouvrat', 'Michel'),
 (104, 'Rabasse Chavarin', 'Abel'),
 (105, 'Roux', 'Charles'),
 (106, 'Alary', None),
 (108, 'Archimbaud', 'Jean'),
 (109, 'Rey', 'Marcel'),
 (110, 'Cooperative', None),
 (111, 'Zafiropulo', 'Costa'),
 (112, 'Prebost', 'Gaston'),
 (113, 'Gomez', 'Rene'),
 (114, 'Brunet', 'Georges'),
 (115, 'Bordonado', 'Raymond'),
 (116, 'Imbert', 'Christian'),
 (117, 'Cooperative', None),
 (118, 'Cooperative', None),
 (119, 'Cooperative', None),
 (121, 'Cooperative', None),
 (122, 'Dupuy', 'Charles'),
 (123, 'Laurent', 'Pierre'),
 (124, 'Daurat Fort', 'Robert'),
 (125, 'Baldes', 'Jean'),
 (126, 'Jouffreau', 'Jean'),
 (127, 'Brumont', 'Alban'),
 (129, 'Barrere', 'Alfred')]

#### Exercise 2.7

What clients (buveurs) have bought at least one wine from 1980?

In [25]:
%%sql 

SELECT DISTINCT
    client.NB, client.NOM, client.PRENOM
FROM 
    client, purchase, wine
WHERE
    client.NB = purchase.NB
    AND wine.MILL = '1980'
    AND wine.NV = purchase.NV
ORDER BY 
    client.NB;

 * sqlite:///wine.db
Done.

[(2, 'Artaud', 'Antonin'),
 (8, 'Aragon', 'Louis'),
 (44, 'Gide', 'Andre'),
 (45, 'Giono', 'Jean'),
 (50, 'Lautreamont', None),
 (61, 'Mallarme', 'Stephane')]

#### Exercise 2.8

What clients (buveurs) have NOT bought any wine from 1980?

In [26]:
%%sql 

SELECT DISTINCT 
    NB, NOM, PRENOM
FROM 
    client
EXCEPT
SELECT DISTINCT
    client.NB, client.NOM, client.PRENOM
FROM 
    client, purchase, wine
WHERE
    client.NB = purchase.NB
    AND purchase.NV = wine.NV
    AND wine.MILL = '1980'
ORDER BY
    client.NB;

 * sqlite:///wine.db
Done.

[(1, 'Aristote', None),
 (3, 'Aron', 'Raymond'),
 (4, 'Apollinaire', 'Guillaume'),
 (5, 'Audiberti', 'Jacques'),
 (6, 'Arrabal', 'Fernando'),
 (7, 'Anouilh', 'Jean'),
 (9, 'Ajar', 'Emile'),
 (10, 'Andersen', 'Yann'),
 (11, 'Breton', 'Andre'),
 (12, 'Bataille', 'Georges'),
 (13, 'Barthes', 'Roland'),
 (14, 'Bory', 'Jean Louis'),
 (15, 'Baudelaire', 'Charles'),
 (16, 'Balzac', 'Honore de'),
 (17, 'Camus', 'Albert'),
 (18, 'Celine', 'Louis Ferdinand'),
 (19, 'Ciceron', None),
 (20, 'Chateaubriand', 'Francois-Rene de'),
 (21, 'Corbiere', 'Tristan'),
 (22, 'Cocteau', 'Jean'),
 (23, 'Corneille', 'Pierre'),
 (24, 'Courrier', 'Paul Louis'),
 (25, 'Char', 'Rene'),
 (26, 'Diderot', 'Denis'),
 (27, 'Dumas', 'Alexandre'),
 (28, 'Dostoievsky', 'Fiodor'),
 (29, 'Fournier', 'Alain'),
 (30, 'La Fontaine', 'Jean de'),
 (31, 'Dante', None),
 (32, 'Eluard', 'Paul'),
 (33, 'Flaubert', 'Gustave'),
 (34, 'Mauriac', 'Francois'),
 (35, 'Fromentin', 'Eugene'),
 (36, 'Maurois', 'Andre'),
 (37, 'Freud', 'Sigmund'),
 (38, 'Montaigne', 'Michel de'),
 (39, 'Montesquieu', None),
 (40, 'Moliere', None),
 (41, 'Gauthier', 'Theophile'),
 (42, 'Goethe', 'Johann Wolfgang von'),
 (43, 'Musset', 'Alfred de'),
 (46, 'Hugo', 'Victor'),
 (47, 'Gary', 'Romain'),
 (48, 'Hardy', 'Thomas'),
 (49, 'Kafka', 'Franz'),
 (51, 'Lafargue', 'Paul'),
 (52, 'Carroll', 'Lewis'),
 (53, 'Lamartine', 'Alphonse de'),
 (54, 'Aurele', 'Marc'),
 (55, 'Michelet', 'Jules'),
 (56, 'Nerval', 'Gerard de'),
 (57, 'Marx', 'Karl'),
 (58, 'Marivaux', 'Pierre Carlet de Chamblain de'),
 (59, 'Nietzsche', 'Friedrich'),
 (60, 'Ovide', None),
 (62, 'Proust', 'Marcel'),
 (63, 'Maupassant', 'Guy de'),
 (64, 'Platon', None),
 (65, 'Pascal', 'Blaise'),
 (66, 'Perec', 'Georges'),
 (67, 'Nin', 'Anais'),
 (68, 'Prevert', 'Jacques'),
 (69, 'Queneau', 'Raymond'),
 (70, 'Paulhan', 'Jean'),
 (71, 'Radiguet', 'Raymond'),
 (72, 'Rabelais', 'Francois'),
 (73, 'Poe', 'Allan Edgard'),
 (74, 'Rimbaud', 'Arthur'),
 (75, 'Ronsard', 'Pierre'),
 (76, 'Racine', 'Jean'),
 (77, 'Rousseau', 'Jean-Jacques'),
 (78, 'Sandier', 'Jules'),
 (79, 'Sade', 'Donatien Alphonse Fran¬ø¬øs de'),
 (80, 'Sand', 'Georges'),
 (81, 'Sartre', 'Jean-Paul'),
 (82, 'Roussel', 'Rene'),
 (83, 'Sophocle', None),
 (84, 'Sue', 'Eugene'),
 (85, 'Segalen', 'Victor'),
 (86, 'Saint Exupery', 'Antoine de'),
 (87, 'Segur', 'Comtesse de'),
 (88, 'Shakespeare', 'William'),
 (89, 'Stendhal', None),
 (90, 'Vian', 'Boris'),
 (91, 'Verlaine', 'Paul'),
 (92, 'Verne', 'Jules'),
 (93, 'Virgile', None),
 (94, 'Zola', 'Emile'),
 (95, 'Zorn', 'Fritz'),
 (96, 'Wilde', 'Oscar'),
 (97, 'Vigny', 'Alfred de'),
 (98, 'Maturin', 'Robert'),
 (99, 'Cesar', 'Jules'),
 (100, 'Woolf', 'Virginia')]

#### Exercise 2.9

What clients (buveurs) have bought ONLY wines from 1980?

In [27]:
%%sql

SELECT DISTINCT 
    client.NB, client.NOM, client.PRENOM
FROM 
    client, purchase, wine
WHERE 
    wine.MILL = '1980'
    AND wine.NV = purchase.NV
    AND purchase.NB = client.NB
EXCEPT
SELECT DISTINCT 
    client.NB, client.NOM, client.PRENOM
FROM 
    client, purchase, wine
WHERE 
    wine.MILL NOT IN ('1980')
    AND wine.NV = purchase.NV
    AND purchase.NB = client.NB
ORDER BY 
    client.NB;

 * sqlite:///wine.db
Done.

[(44, 'Gide', 'Andre'), (45, 'Giono', 'Jean'), (50, 'Lautreamont', None)]

#### Exercise 2.10

List all wines from 1980

In [28]:
%%sql 

SELECT 
    *
FROM 
    wine
WHERE
    MILL = '1980'
ORDER BY
    NV;

 * sqlite:///wine.db
Done.

[(1, 'Mercurey', 11.5, 1980),
 (4, 'Mercurey', 10.9, 1980),
 (16, 'Meursault', 12.1, 1980),
 (20, 'Cote de Brouilly', 12.1, 1980),
 (26, 'Chateau Corton Grancey', None, 1980),
 (28, 'Volnay', 11, 1980),
 (43, 'Fleurie', 11.4, 1980),
 (74, 'Arbois', 12, 1980),
 (78, 'Etoile', 12, 1980),
 (79, 'Seyssel', 11, 1980),
 (80, 'Seyssel', 11, 1980),
 (81, 'Cornas', 11.1, 1980),
 (82, 'Cornas', 11, 1980),
 (83, 'Saint Amour', 10, 1980),
 (84, 'Rasteau', 10, 1980),
 (85, 'Tavel', 11, 1980),
 (86, 'Tavel', 11, 1980),
 (87, 'Cotes de Provence', None, 1980)]

#### Exercise 2.11

What are the wines from 1980 bought by NB=2?

In [29]:
%%sql 

SELECT 
    wine.NV, wine.CRU, wine.MILL, wine.DEGRE
FROM 
    wine, purchase
WHERE
    wine.MILL = '1980'
    AND purchase.NB = '2'
    AND wine.NV = purchase.NV
ORDER BY 
    wine.NV;

 * sqlite:///wine.db
Done.

[(1, 'Mercurey', 1980, 11.5)]

#### Exercise 2.12

What clients (buveurs) have bought ALL the wines from 1980?

In [30]:
%%sql 

SELECT 
    client.NB, client.NOM, client.PRENOM
FROM 
    client, purchase, wine 
WHERE
    purchase.NB = client.NB
    AND purchase.NV = wine.NV
GROUP BY 
    client.NB
HAVING 
    COUNT(wine.NV) = ( 
        SELECT 
            COUNT(wine.NV)
        FROM 
            wine
        WHERE 
            wine.MILL = '1980'
    );

 * sqlite:///wine.db
Done.

[(44, 'Gide', 'Andre')]